In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
use uber

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', 5000.00),
(2, 'Priya', NULL, '98765', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '98765', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
5 rows affected.

[]

In [5]:
%%sql
SELECT 
    customer_name, 
    amount,
    CASE 
        WHEN amount > 4000 THEN 'High Spender'
        WHEN amount BETWEEN 2000 AND 4000 THEN 'Medium Spender'
        WHEN amount <= 2000 THEN 'Low Spender'
        ELSE 'No Data'
    END AS spending_category
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00'), 'High Spender'),
 ('Priya', None, 'No Data'),
 ('Arjun', Decimal('1500.00'), 'Low Spender'),
 ('Meena', Decimal('2500.00'), 'Medium Spender'),
 ('Karthik', Decimal('3000.00'), 'Medium Spender')]

In [6]:
%%sql
select customer_name,
amount,
case 
    when email is null and phone_number is null then '9999'  -- ordering matters
    when email is null  then phone_number
    else email
end  as contact 

from CustomerData

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00'), 'ravi@example.com'),
 ('Priya', None, '98765'),
 ('Arjun', Decimal('1500.00'), 'arjun@example.com'),
 ('Meena', Decimal('2500.00'), '9999'),
 ('Karthik', Decimal('3000.00'), 'karthik@example.com')]